{
	"id": "american-sniper-opinion",
	"title": "Thoughts on American Sniper",
	"date": 1421798165,
	"snippet": "After watching American Sniper, I was left with the impression that America's heroes may not be my heroes.",
	"thumbURL": "server/pics/american-sniper/thumb.jpg",
	"images": [

	],
	"paragraphs": [
		"Disclaimer: These are my immediate reactions to watching American Sniper. I’m sure that the reality of what happened has been dramatized in the movie. As such, this is more a reaction to the artistic work than the actual life of Chris Kyle. I don’t harbor any delusions that I actually know his mindset, ideals, or the true story. Nor have I read the book that American Sniper is based off of.",
		"It’s not that I don’t appreciate what Chris Kyle and hundreds of other veterans have done to defend the United States. But several months ago I listened to a podcast; it was This American Life Podcast Episode 515: Good Guys (Act Four: Deep Dark Open Secret). This was a fascinating story about a soldier who joined the military and sent back audio records of his thoughts and emotions while deployed in Afghanistan.",
		"It has been a while since I listened to the episode, but I remember distinctly the way that the soldiers are described. Originally, the narrator was very different from fellow soldiers. He had been a computer programmer who decided that he wanted something different; a new experience. Many of the other soldiers had signed up for a variety of reasons, but many of them expressed their desire to kill someone.",
		"And apparently, over his time of service, this soldier began to adopt the same mindset: he wanted to feel what it’s like to kill someone. In essence, the idea of the completely remorseful soldier is a fallacy; there is true malice behind the aggressive actions of the military.",
		"Which brings me back to American Sniper and Chris Kyle. As I watched the movie, I had a sense of that same malice in America’s hero. I don’t think that he claims otherwise. In fact he says that he has no remorse over the enemy combatants that he killed, only over his comrades that he was unable to save.",
		"But one word specifically stood out for me: ‘savages’. It is the word the Kyle used to describe the enemy combatants that he shot and killed. It is a dehumanizing word, and while it might be appropriate for characters such as the ‘Butcher’, using it as a blanket statement is dangerous. Like Kyle, everyone in war is fighting for some ideal or reason. The main antagonist of the movie, the sniper Mustafa, is not portrayed as being particularly viscous or cruel. Like Kyle, he is simply a sniper doing his job for what he believes is right.",
		"I think it is important to always remember that war is a completely subjective engagement. Both sides truly believe they are in the right, and therefore will go to great lengths in order to fight for their ideals. In addition, we must always be aware of what it is that we are fighting for. Is it aggression for the sake of feeling what it is like to kill someone? Is it to protect the ones you love? To protect or spread a religion or belief system?",
		"Ideally, our soldiers will be the truly selfless people that we imagine them to be. Remorseful at taking a life, but passionate about protecting their loved ones from enemies. Even then, it is important to question those enemies: are they real or perceived? But as This American Life demonstrates, war is a terrible place, and it can even corrupt those with pure intentions."
	]
}